//定义一个MyInput类，接受一个字符串作为构造函数的输入，把该字符串按逗号拆成多个数据。
// 编写一个GetInput(int)函数，获取字符串的第i个数据（i从0开始）。
// 
//定义一个Point类，有两个数据成员，记录平面直角坐标系的x, y坐标。
// 
//定义一个Quadrilateral类，有4个数据成员（Point），表示平面上四个坐标点。
// 
//编写以下成员函数：
// 
//（1）按4个点的顺序判断该四边形是否是矩形
//（2）计算面积：如果四边形是矩形，则计算该矩形的面积，否则面积当成0
//
//编写一个main函数，读入数据，每行有8个数据，表示四边形4个点的坐标，输出该四边形的面积(保留4位小数)。
// 
//输入数据：
//1, 2, 3, 4, 5, 6, 7, 8
//1, 0, 0, 1, -1, 0, 0, -1
// 
//输出结果：
//0
//2.0000
//说明：第一行8个数据表示4个坐标点：(1, 2), (3, 4), (5, 6), (7, 8)，
// 
// 这四个点并不构成矩形，所以输出0.第二行表示(1, 0), (0, 1), (-1, 0), (0, -1) 四个点，
// 
// 按顺序连接起来构成矩形，其面积为2。(本题分数:25)


#include<iostream>
using namespace std;


int main()
{





	system("pause");
	return 0;
}